{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "NodeUpgrade",
			"Children": [
				{
					"Source":
					{
						"Text": "+{Amount}"
					},
					"Translation":
					{
						"Text": "+{Amount}"
					},
					"Key": "ui.refund_amount"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "Schließen"
					},
					"Key": "ui.close"
				},
				{
					"Source":
					{
						"Text": "Cost"
					},
					"Translation":
					{
						"Text": "Kosten"
					},
					"Key": "ui.cost"
				},
				{
					"Source":
					{
						"Text": "Current purity"
					},
					"Translation":
					{
						"Text": "Aktuelle Reinheit"
					},
					"Key": "ui.current_purity"
				},
				{
					"Source":
					{
						"Text": "Downgrade"
					},
					"Translation":
					{
						"Text": "Herabstufen"
					},
					"Key": "ui.downgrade"
				},
				{
					"Source":
					{
						"Text": "Extraction rate ×{Before} → ×{After}"
					},
					"Translation":
					{
						"Text": "Abbaurate ×{Before} → ×{After}"
					},
					"Key": "ui.extraction_rate"
				},
				{
					"Source":
					{
						"Text": "Impure"
					},
					"Translation":
					{
						"Text": "Unrein"
					},
					"Key": "purity.impure"
				},
				{
					"Source":
					{
						"Text": "Missing: {Count}"
					},
					"Translation":
					{
						"Text": "Fehlt: {Count}"
					},
					"Key": "ui.missing"
				},
				{
					"Source":
					{
						"Text": "New purity"
					},
					"Translation":
					{
						"Text": "Neue Reinheit"
					},
					"Key": "ui.new_purity"
				},
				{
					"Source":
					{
						"Text": "No valid upgrade cost is defined for this node"
					},
					"Translation":
					{
						"Text": "Für diesen Knoten sind keine gültigen Verbesserungskosten festgelegt"
					},
					"Key": "err.config"
				},
				{
					"Source":
					{
						"Text": "Node downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "Knoten auf {Purity} herabgestuft"
					},
					"Key": "msg.downgraded"
				},
				{
					"Source":
					{
						"Text": "Node upgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "Knoten auf {Purity} verbessert"
					},
					"Key": "msg.upgraded"
				},
				{
					"Source":
					{
						"Text": "Normal"
					},
					"Translation":
					{
						"Text": "Normal"
					},
					"Key": "purity.normal"
				},
				{
					"Source":
					{
						"Text": "Not enough inventory space for the refund"
					},
					"Translation":
					{
						"Text": "Nicht genug Inventarplatz für die Rückerstattung"
					},
					"Key": "err.inventory_full"
				},
				{
					"Source":
					{
						"Text": "Not enough items"
					},
					"Translation":
					{
						"Text": "Nicht genug Gegenstände"
					},
					"Key": "err.not_enough_items"
				},
				{
					"Source":
					{
						"Text": "Open node upgrade menu"
					},
					"Translation":
					{
						"Text": "Menü zur Knotenverbesserung öffnen"
					},
					"Key": "input.open_menu"
				},
				{
					"Source":
					{
						"Text": "Opens the upgrade menu of the resource node you are looking at."
					},
					"Translation":
					{
						"Text": "Öffnet das Verbesserungsmenü des Ressourcenknotens, den du ansiehst."
					},
					"Key": "input.open_menu.description"
				},
				{
					"Source":
					{
						"Text": "Press {Key} to upgrade this node"
					},
					"Translation":
					{
						"Text": "Drücke {Key}, um diesen Knoten zu verbessern"
					},
					"Key": "hint.open"
				},
				{
					"Source":
					{
						"Text": "Pure"
					},
					"Translation":
					{
						"Text": "Rein"
					},
					"Key": "purity.pure"
				},
				{
					"Source":
					{
						"Text": "Refund"
					},
					"Translation":
					{
						"Text": "Rückerstattung"
					},
					"Key": "ui.refund"
				},
				{
					"Source":
					{
						"Text": "Refund if downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "Rückerstattung bei Herabstufung auf {Purity}"
					},
					"Key": "ui.refund_header"
				},
				{
					"Source":
					{
						"Text": "Resource node upgrade"
					},
					"Translation":
					{
						"Text": "Ressourcenknoten verbessern"
					},
					"Key": "ui.title"
				},
				{
					"Source":
					{
						"Text": "This node cannot be upgraded"
					},
					"Translation":
					{
						"Text": "Dieser Knoten kann nicht verbessert werden"
					},
					"Key": "err.unsupported"
				},
				{
					"Source":
					{
						"Text": "This node cannot go below its original purity"
					},
					"Translation":
					{
						"Text": "Dieser Knoten kann nicht unter seine ursprüngliche Reinheit fallen"
					},
					"Key": "err.base_purity"
				},
				{
					"Source":
					{
						"Text": "This node is already at maximum purity"
					},
					"Translation":
					{
						"Text": "Dieser Knoten hat bereits die maximale Reinheit"
					},
					"Key": "err.max_purity"
				},
				{
					"Source":
					{
						"Text": "Upgrade"
					},
					"Translation":
					{
						"Text": "Verbessern"
					},
					"Key": "ui.upgrade"
				},
				{
					"Source":
					{
						"Text": "{Owned} / {Required}"
					},
					"Translation":
					{
						"Text": "{Owned} / {Required}"
					},
					"Key": "ui.amount_owned"
				}
			]
		},
		{
			"Namespace": "NodeUpgradeDebug",
			"Children": [
				{
					"Source":
					{
						"Text": ", "
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemSeparator"
				},
				{
					"Source":
					{
						"Text": "/nodeupgrade (alias /nu) info | setpurity <impure|normal|pure> | upgrade | downgrade | give <ItemClass> [amount] | validate | reload"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Usage"
				},
				{
					"Source":
					{
						"Text": "Aim at a resource node (or at an extractor built on it) first."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoTarget"
				},
				{
					"Source":
					{
						"Text": "No cost table loaded. Check FactoryGame.log for LogNodeUpgrade errors."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateNotLoaded"
				},
				{
					"Source":
					{
						"Text": "No extractor or generator on this node."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNoBuilding"
				},
				{
					"Source":
					{
						"Text": "Node {Name}: {Resource} ({Class}), kind {Kind}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNode"
				},
				{
					"Source":
					{
						"Text": "Paid for {Tier}: {Items}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPaid"
				},
				{
					"Source":
					{
						"Text": "Purity {Purity} | original {Original} | modified by the mod: {Modified} | cost entry: {Entry}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPurity"
				},
				{
					"Source":
					{
						"Text": "This command needs you on foot (not in a vehicle)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoCharacter"
				},
				{
					"Source":
					{
						"Text": "costs.json reloaded: {Result}, {Entries} entries, {Errors} errors, {Warnings} warnings. Already paid refunds are unchanged."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ReloadDone"
				},
				{
					"Source":
					{
						"Text": "failed (previous table kept)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Failed"
				},
				{
					"Source":
					{
						"Text": "no"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "No"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "None"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoEntry"
				},
				{
					"Source":
					{
						"Text": "nothing"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Nothing"
				},
				{
					"Source":
					{
						"Text": "ok"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Ok"
				},
				{
					"Source":
					{
						"Text": "unknown item"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UnknownItem"
				},
				{
					"Source":
					{
						"Text": "yes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Yes"
				},
				{
					"Source":
					{
						"Text": "{Amount} x {Item}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemAmount"
				},
				{
					"Source":
					{
						"Text": "{Entries} entries, {Found} / {Total} item classes found, refund ratio {Ratio}. File: {Path}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateSummary"
				},
				{
					"Source":
					{
						"Text": "{Entry} / {Tier}: item class {Class} not found"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateMissing"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Min} - {Max} MW"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoGeoThermal"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Rate}/min, cycle {Cycle} s"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoExtractor"
				}
			]
		}
	]
}